Repository: yshialexandra/Optimizing_LLM_Chinese_Translation_through_Syntactic_Feature_Extraction_and_Representation_Editing
Catalog: yshibachlorpaper/Yiyan_tmx/A24A.tmx
Source language: en_us
Languages: zh_cn

source: Iceland's Volcanic Ash Halts Flights Across Europe
zh_cn: 冰岛火山灰迫使欧洲航班停飞

source: (LONDON) — Ash clouds from Iceland's spewing volcano disrupted air traffic across Northern Europe on Thursday as authorities closed British and Nordic air space, shut down Europe's busiest airport at Heathrow and canceled hundreds of flights.
zh_cn: 本周四，冰岛火山喷发所产生的火山灰已经扰乱了整个北欧的航空运输，英国当局已经关闭了从英国飞往北欧的部分领空，欧洲最繁忙的希思罗机场也被关闭，数百架航班被取消。

source: Britain's Civil Aviation Authority said non-emergency flights would be banned until at least 6 p.m. (1700 GMT, 1 p.m. EDT).
zh_cn: 英国民用航空局表示，非紧急情况下的相关飞行一律禁止，解禁直到下午六点结束。

source: Irish authorities also closed their air space for eight hours.
zh_cn: 爱尔兰相关部门也将关闭领空8小时之久。

source: London Heathrow, Europe's business airport, handles upwards of 1,200 flights and 180,000 passengers per day.
zh_cn: 伦敦的希思罗机场每天进出航班1200多架，运送乘客180000人。

source: The closure also affected London's second- and third-largest airports, Gatwick and Stansted.
zh_cn: 关闭风潮亦波及到了伦敦的第二大机场盖特威客和第三大机场斯坦斯特德。

source: It was not immediately clear when flights would resume.
zh_cn: 目前为止还不清楚航班将于何时恢复。

source: With the major trans-Atlantic hub at Heathrow closed, dozens of flights to the United States were on hold, and cancelations spread across the continent to major hubs at Brussels, Amsterdam, Geneva and Paris, where flights heading north were canceled until midnight. (See a brief history of airport snafus.)
zh_cn: 作为大西洋主要转运中心，希思罗机场的关闭导致几十架飞往美国的航班停飞，欧洲其他的重要中转机场如布鲁塞尔、阿姆斯特丹、日内瓦和巴黎的机场飞往北欧的航班也被取消，直至午夜才能恢复。

source: In Iceland, hundreds of people have fled rising floodwaters since the volcano under the Eyjafjallajokull (ay-yah-FYAH'-plah-yer-kuh-duhl) glacier erupted Wednesday for the second time in less than a month.
zh_cn: 在冰岛，自本周三位于艾雅法拉冰川底下的火山喷发以后，因为不断上涨的洪水，已经有好几百人撤离了这一地区，在不到一个月的时间里这已经是这座火山的第二次喷发了。

source: As water gushed down the mountainside, rivers rose up to 10 feet (3 meters) by Wednesday night.
zh_cn: 洪水涌到了山下，截至周三晚间河水已经上涨至10英尺（3米）的高度了。

source: The ash cloud has not disrupted operations at Iceland's Keflavik airport or caused problems in the capital of Reykjavik, but has affected the southeastern part of the island, said meteorologist Thorsteinn Jonsson. In one area, visibility was reduced to 150 yards (meters) this morning, he said, and farmers were advised to keep livestock indoors to protect them from eating ash particles as sharp as glass.
zh_cn: 火山灰还没有对冰岛凯夫拉维克机场的日常运营造成干扰，冰岛首都雷克雅未克也没有因此而陷入困境。但据气象学家Thorsteinn Jonsson介绍说，冰岛的东南部受到了影响，某些地区的能见度在今晨降到了150米，农民们被劝阻要将牲畜关在户内，以免误食同玻璃一样锋利的火山灰颗粒。

source: The volcano was sending up smoke and ash that posed "a significant safety threat to aircraft," Britain's National Air Traffic Service said, as visibility is compromised and debris can get sucked into airplane engines.
zh_cn: 火山还在冒出浓烟和灰尘，英国国家空运局表示这对飞机造成了严重的安全威胁，首先是能见度不够，其次灰烬残骸会被吸入飞机引擎中导致熄火。

source: Emirates airline canceled 10 roundtrip flights between Dubai and Britain on Thursday because of the ash cloud.
zh_cn: 在周四，由于尘云的影响，阿联酋航空公司被迫取消了往返于迪拜和英国之间的10个班次航班。

source: "I think I might cry," said Ann Cochrane, 58, of Toronto, one of the passengers stranded in Glasgow. "I just wish I was on a beach in Mexico."
zh_cn: 众多乘客滞留在格拉斯哥，58岁的Ann Cochrane来自多伦多，她说：“我觉得我都快哭出来了，原本我还希望能到墨西哥的海滩度个假呢。”

source: In northern Sweden all air traffic was suspended, affecting the cities of Skelleftea, Lulea, Kiruna and Hemavan, the national aviation authority said.
zh_cn: 瑞典国家民航局表示，在瑞典北部，所有的空中航班都被暂停，波及城市包括谢莱夫特奥、吕勒奥、基律纳和赫玛旺。

source: Air traffic in northern Finland was also halted.
zh_cn: 芬兰北部的空中交通亦处于停顿状态。

source: Norway's King Harald V and Queen Sonja — who had planned to fly Thursday to Copenhagen for the Danish queen's 70th birthday — were looking to take a "car, boat or train."
zh_cn: 挪威国王哈拉尔德五世和王后索尼娅本计划周四飞往哥本哈根参加丹麦王后的70大寿，但现在看来只能乘汽车、轮船或火车前往了。

source: A canceled trans-Atlantic flight left Norway's Prime Minister Jens Stoltenberg grounded in New York.
zh_cn: 中转航班取消让挪威首相Jens Stoltenberg也被困在了纽约。

source: The U.S. Geological Survey said about 100 encounters of aircraft with volcanic ash were documented from 1983 to 2000; in some cases engines shut down briefly after sucking in volcanic debris, but there have been no fatal incidents.
zh_cn: 美国地质调查局表示，从1983年到2000年，有记录在案的飞机与火山灰遭遇事件约有100起；其中有几例是飞机引擎在吸入火山灰残骸后短暂熄火，但幸好没有发生重大事故。

source: In 1989, a KLM Royal Dutch Airlines Boeing 747 flew into an ash cloud from Alaska's Redoubt volcano and lost all power, dropping from 25,000 feet to 12,000 feet (7,500 meters to 3,600) before the crew could get the engines restarted.
zh_cn: 1989年，一架荷兰皇家航空公司的波音747客机飞入一片火山尘云之中，这片尘云是由于阿拉斯加的里道特火山喷发所致，飞机顿时动力全无，从25000英尺高空速降至12000英尺（7500米至3600米），幸好在机组人员的竭力挽救之下，飞机引擎才恢复了工作。

source: The plane landed safely.
zh_cn: 最终，该飞机安全着陆。

source: In another incident in the 1980s, a British Airways 747 flew into a dust cloud and the grit sandblasted the windscreen. The pilot had to look out a side window to land safely.
zh_cn: 还有一次事故也是发生在上世纪八十年代，当时英国航空公司的一架波音747客机也是飞入尘云之中，沙砾全都喷在了挡风玻璃之上，飞行员只能面朝侧窗才将飞机安全着陆。

source: Volcanic ash is formed from explosive eruptions. Particles as hard as a knife blade range in size from as small as 0.001 millimeters (1/25,000 inch) to 2 millimeters (1/12 inch), the Geological Survey says.
zh_cn: 美国地质调查局相关人士解释说，火山灰是在火山爆炸性喷发过程中形成的，其颗粒如同刀身一样坚硬，大小从0.001毫米到2毫米之间。

source: Ash can melt in the heat of an aircraft engine and then solidify again, disrupting the mechanics, the agency says.
zh_cn: 由于飞机引擎的热量，被吸入的火山灰会先熔化再凝固，严重破坏了飞机的机械性能。
